In [157]:
import numpy as np
import pandas as pd

In [158]:
index = [('California', 2000), 
         ('California', 2010),
         ('New York', 2000), 
         ('New York', 2010), 
         ('Texas', 2000), 
         ('Texas', 2010)]

In [159]:
index

[('California', 2000),
 ('California', 2010),
 ('New York', 2000),
 ('New York', 2010),
 ('Texas', 2000),
 ('Texas', 2010)]

In [160]:
populations = [33871648, 37253956,
                           18976457, 19378102,
                           20851820, 25145561]

In [161]:
populations

[33871648, 37253956, 18976457, 19378102, 20851820, 25145561]

In [162]:
pop = pd.Series(populations, index=index)

以元组作为索引，可以看出每一个元组整体是一个索引

In [163]:
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [164]:
index = pd.MultiIndex.from_tuples(index) # 转化成多级索引

In [165]:
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [166]:
pop.reindex(index)  # 重新使用索引，或者使用下面方法

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [167]:
pop2 = pd.Series(populations, index=index)

使用多维索引，可以看出索引不是一个元组了，而是一个多层级的索引

In [168]:
pop2  # 多层索引

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

多次索引，简单使用

In [169]:
pop2[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [170]:
pop2.loc['New York':'Texas',2010]

New York  2010    19378102
Texas     2010    25145561
dtype: int64

In [171]:
pop2.iloc[0:2] #  这里好像又是按照元组的索引

California  2000    33871648
            2010    37253956
dtype: int64

unstack() 方法可以快速将一个多级索引的 Series 转化为普通索引的 DataFrame

In [172]:
pop2.unstack()

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

stack() 方法实现相反的效果

In [173]:
pop_df = pop2.unstack()
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [174]:
pop_df0 = pop2.unstack().unstack()
pop_df0

2000  California    33871648
      New York      18976457
      Texas         20851820
2010  California    37253956
      New York      19378102
      Texas         25145561
dtype: int64

In [175]:
pop_df0.unstack()

      California  New York     Texas
2000    33871648  18976457  20851820
2010    37253956  19378102  25145561

In [176]:
pop_df0.unstack().unstack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [177]:
pop3 = pop.reindex(index)
print(pop3)
pop_df1 = pd.DataFrame({'total':pop3,'under18':[9267089, 9284094,4687374, 4318033,5906301, 6879014]})

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [178]:
pop_df1

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [179]:
f_u18 = pop_df1['under18'] / pop_df1['total']

In [180]:
f_u18

California  2000    0.273594
            2010    0.249211
New York    2000    0.247010
            2010    0.222831
Texas       2000    0.283251
            2010    0.273568
dtype: float64

In [181]:
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [182]:
f_u18.unstack()[2000]

California    0.273594
New York      0.247010
Texas         0.283251
Name: 2000, dtype: float64